sandTrapCaseDir/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


6
(
inletWater
{
    type patch;
    nFaces 40;
    startFace 180777;
}

outletWater
{
    type patch;
    nFaces 280;
    startFace 180817;
}

freeSurface
{
    type patch;
    nFaces 3468;
    startFace 181097;
}

leftSide
{
    type wall;
    nFaces 5008;
    startFace 184565;
}

rightSide
{
    type wall;
    nFaces 5016;
    startFace 189573;
}

bedWall
{
    type wall;
    nFaces 3588;
    startFace 194589;
}

)


// ************************************************************************* //
