sandTrapCaseDir/0/eddyvisc
FoamFile 
{
    version      2.0;
    format       ascii;
    class        volScalarField;
    location     "0";
    object       eddyvisc;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    bedWall
    {
        type            nutURoughWallFunction;
	value uniform 0;
        Ks uniform 0.01; 
        Cs uniform 0.5;
	roughnessHeight 0.01;
	roughnessConstant 0.5;
	roughnessFactor 1;
    }
    leftSide
    {
        type            nutURoughWallFunction;
	value uniform 0;
        Ks uniform 0.01; 
        Cs uniform 0.5;
	roughnessHeight 0.01;
	roughnessConstant 0.5;
	roughnessFactor 1;
    }
    rightSide
    {
        type            nutURoughWallFunction;
	value uniform 0;
        Ks uniform 0.01; 
        Cs uniform 0.5;
	roughnessHeight 0.01;
	roughnessConstant 0.5;
	roughnessFactor 1;
    }
    freeSurface
    {
        type            zeroGradient;
    }
    inletWater
    {
        type            calculated;
        value           uniform 0.1;
    }
    outletWater
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            empty;
    }
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
