sandTrapCaseDir/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;
    div(phi,U)      bounded Gauss linearUpwind grad(U);
//    div(phi,U)      Gauss linearUpwind grad(U);
//    div(phi,U)      Gauss upwind;
    div(phi,k)      bounded Gauss upwind;
    div(phi,epsilon) bounded Gauss upwind;
    div(phi,R)      bounded Gauss upwind;
    div(phi_c01,Conc01)  bounded Gauss upwind; 
    div(phi_d01,Conc01)  bounded Gauss upwind;
    div(phi,Conc01)    bounded Gauss upwind;

    div(phi_c02,Conc02)  bounded Gauss upwind; 
    div(phi_d02,Conc02)  bounded Gauss upwind;
    div(phi,Conc02)    bounded Gauss upwind;

    div(phi_c03,Conc03)  bounded Gauss upwind; 
    div(phi_d03,Conc03)  bounded Gauss upwind;
    div(phi,Conc03)    bounded Gauss upwind;

    div(phi_c045,Conc045)  bounded Gauss upwind; 
    div(phi_d045,Conc045)  bounded Gauss upwind;
    div(phi,Conc045)    bounded Gauss upwind;

//    div(interpolate(Umod) & mesh.Sf(),Conc)  bounded Gauss upwind;
    div(R)          Gauss linear;
    div(phi,nuTilda) bounded Gauss upwind;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist

{
     method  meshWave;
}


// ************************************************************************* //

